DataProcessors/ФиллРэйтОбработка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ФиллРэйтОбработка</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодОтчета</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ЗаказыПокупателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПокупателей</Name>
			<Comment>Заказы покупателей</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заказано</Name>
					<Comment>Количество номенклатуры по заказу</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>Количество номенклатуры, зарезервированной на складе для этого заказа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РезервСвободный</Name>
					<Comment>Количество номенклатуры, зарезервированной на складе для этого заказа из свободного остатка</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма заказанной номенклатуры в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма заказанной номенклатуры в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Comment>Вид операции с заказом(заказ, резервирование...)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗамены</Name>
					<Comment>Идентификатор операции замены заказанного товара на другой</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент, разместивший заказ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Comment>Документ оформления заказа</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРемонт</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказВнутренний</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказIT</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура заказа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры заказа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании на котором был зарезервирован товар для этого заказа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ПартииТоваровКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ПартииТоваровКомпании</Name>
			<Comment>Блок учета партий товаров компании собственных и принятых на комиссию</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток товара на складе в разрезе партий</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Comment>Проект</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Comment>Документ продажи</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщикуАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАктивов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионера</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеСмены</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераЗаАвтомобили</v8:Type>
						<v8:Type>cfg:DocumentRef.АктРазногласий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии, определяющий, чей товар (купленный компанией или принятый на комиссию)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия по которой поступил или был взят на комиссию товар</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ОстаткиТоваровКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваровКомпании</Name>
			<Comment>Блок учета остатков товаров компании</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток номенклатуры на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>Количество зарезервированного товара на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРозн</Name>
					<Comment>Розничная сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПереоценки</Name>
					<Comment>Количество, переоцененного товара</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена после переоценки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент или подразделение получатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСкидки</Name>
					<Comment>Сумма скидки в валюте регл. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/УценкаТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>УценкаТоваров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НеВыгружатьНаАвито</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыРассылок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипыРассылок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КлиенскаяСлужба</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Руководители</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сервис</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетПоУРВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВсеОтчетыПоУРВ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучателиСкладскихОтчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтарыеЗапасы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОптовыеПродажи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеоплаченныеЗН</Name>
					<Comment>Неоплаченные заказ-наряды</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВсеНеоплаченныеЗН</Name>
					<Comment>Все неоплаченные заказ-наряды</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НезакрытыеЗН</Name>
					<Comment>Незакрытые заказ-наряды</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВсеНезакрытыеЗН</Name>
					<Comment>Все незакрытые заказ-наряды</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ФиллРэйтОбработка/Ext/ObjectModule.bsl
Процедура ВыполнитьОбработку() Экспорт
	 
	 Сообщить("Работает процедура ВыполнитьОбработку()");
	 
	 // 1 отчет - по филрэйт
	 Запрос = Новый Запрос;
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	ЗаказыПокупателейОбороты.Период КАК Период,
	 |	ЗаказыПокупателейОбороты.Регистратор КАК Регистратор,
	 |	ЗаказыПокупателейОбороты.Заказ,
	 |	ЗаказыПокупателейОбороты.Номенклатура КАК Номенклатура,
	 |	ЗаказыПокупателейОбороты.СкладКомпании КАК Склад,
	 |	ЗаказыПокупателейОбороты.СкладКомпании.Подразделение.ДилерскийЦентр КАК ДилЦентр,
	 |	СУММА(ЗаказыПокупателейОбороты.ЗаказаноПриход) КАК Затребовано,
	 |	СУММА(ЗаказыПокупателейОбороты.РезервПриход) КАК Получено,
	 |	ЗаказыПокупателейОбороты.Номенклатура.Артикул КАК Артикул,
	 |	ЗаказыПокупателейОбороты.СкладКомпании.Подразделение КАК Подразделение
	 |ИЗ
	 |	РегистрНакопления.ЗаказыПокупателей.Обороты(&ДатаНачала, &ДатаКонца, Запись, ) КАК ЗаказыПокупателейОбороты
	 |ГДЕ
	 |	ТИПЗНАЧЕНИЯ(ЗаказыПокупателейОбороты.Регистратор) = ТИП(Документ.ЗаказПокупателя)
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ЗаказыПокупателейОбороты.Номенклатура,
	 |	ЗаказыПокупателейОбороты.Заказ,
	 |	ЗаказыПокупателейОбороты.СкладКомпании,
	 |	ЗаказыПокупателейОбороты.Период,
	 |	ЗаказыПокупателейОбороты.Регистратор,
	 |	ЗаказыПокупателейОбороты.Номенклатура.Артикул,
	 |	ЗаказыПокупателейОбороты.СкладКомпании.Подразделение.ДилерскийЦентр,
	 |	ЗаказыПокупателейОбороты.СкладКомпании.Подразделение
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	Период,
	 |	Регистратор,
	 |	Артикул";
	 
	 ДатаНачалаОтчета    = НачалоДня(ДобавитьМесяц(ТекущаяДата(),-12));
	 ДатаОкончанияОтчета = КонецДня(ТекущаяДата());
	 
	 Запрос.УстановитьПараметр ( "ДатаНачала", ДатаНачалаОтчета );
	 Запрос.УстановитьПараметр ( "ДатаКонца", ДатаОкончанияОтчета );
	 
	 ТЗ =  Запрос.Выполнить().Выгрузить();
	 
	 //ТЗ.ВыбратьСтроку();
	 
	 ТабДок = Новый ТабличныйДокумент;
	 
	 Макет = ПолучитьМакет("МакетПоДЦ");
	 
	 ОбластьЗаголовок = Макет.ПолучитьОбласть("Заг");
	 ПериодСтрокой = ПредставлениеПериода(ДатаНачалаОтчета, ДатаОкончанияОтчета, "ФП=истина"); 
	 
	 ОбластьЗаголовок.Параметры.Загол = "Отчет Initial FillRate по количеству за период "+ПериодСтрокой;
	 ОбластьЗаголовок.Параметры.ЗаголРасчет = "Доступное количество на момент резервирования заказа клиента / общее заказанное кол-во. Цель: Более 80%";
	 
	 ТабДок.Вывести(ОбластьЗаголовок);
	 
	 ОбластьШапки = Макет.ПолучитьОбласть("Шапка");
	 ТабДок.Вывести(ОбластьШапки);
	 
	 ВсегоПолучено = 0;
	 
	 //ОбластьСтр = Макет.ПолучитьОбласть("ОбластьСтрок");
	 
	 Для Каждого стр из ТЗ Цикл
		 
  		 ПолученоТек = Стр.Получено;
 		 
		 Если Стр.Получено<Стр.Затребовано Тогда
			 ОстатокНаСкладе=0;
			 ОстатокНаСкладе = ПолучитьОстаткиНоменклатурыНаСкладах(Стр.Номенклатура,Стр.Период); 
			 //Сообщить("ОстатокНаСкладе = "+ОстатокНаСкладе+" для катал.№ "+Стр.Номенклатура.Артикул+" для "+Стр.Номенклатура+" и периода "+Стр.Период);
			 Если ОстатокНаСкладе > Стр.Затребовано Тогда
				 ПолученоТек  = Стр.Затребовано;
			 Иначе	
				 ПолученоТек  = ОстатокНаСкладе;
			 КонецЕсли; 
			 Стр.Получено = ПолученоТек;	
		 КонецЕсли; 
 		 
	 КонецЦикла;
	 
	 ТЗ.Свернуть("ДилЦентр","Затребовано,Получено");
	 ТЗ.Сортировать("ДилЦентр");
	 
	 //ТЗ.ВыбратьСтроку();
	 
	 ОбластьСтр = Макет.ПолучитьОбласть("ОбластьСтрок");
	 
	 НПП = 0;
	 
	 Для Каждого стр из ТЗ Цикл
		 НПП = НПП + 1;
		 ОбластьСтр.Параметры.НПП            = НПП;	
		 ОбластьСтр.Параметры.ДилерскийЦентр = Стр.ДилЦентр;	
		 ОбластьСтр.Параметры.Затребовано    = Формат(Стр.Затребовано,"ЧЦ=15; ЧДЦ=3");	
		 ОбластьСтр.Параметры.Получено       = Формат(Стр.Получено,"ЧЦ=15; ЧДЦ=3");	
		 ОбластьСтр.Параметры.ПроцентУд      = ?(Число(Стр.Затребовано)>0,Формат(100*Число(Стр.Получено)/Число(Стр.Затребовано),"ЧЦ=7; ЧДЦ=2"),"");;	
		 ТабДок.Вывести(ОбластьСтр);
	 КонецЦикла;
	 
	 ТЗ.Свернуть(,"Затребовано,Получено");
	 
	 //ТЗ.ВыбратьСтроку();
	 
	 ОбластьИт = Макет.ПолучитьОбласть("ОбластьИт");
	 
	 Если ТЗ.Количество() > 0 Тогда
		 Для Каждого стр из ТЗ Цикл
			 ОбластьИт.Параметры.Затребовано    = Формат(Стр.Затребовано,"ЧЦ=15; ЧДЦ=3");	
			 ОбластьИт.Параметры.Получено       = Формат(Стр.Получено,"ЧЦ=15; ЧДЦ=3");	
			 ОбластьИт.Параметры.ПроцентУд      = ?(Число(Стр.Затребовано)>0,Формат(100*Число(Стр.Получено)/Число(Стр.Затребовано),"ЧЦ=7; ЧДЦ=2"),"");;	
			 ТабДок.Вывести(ОбластьИт);
			 Прервать;
		 КонецЦикла;
	 КонецЕсли; 
	 
	 // 2 отчет - по себестоимости складов
	 
	 Запрос = Новый Запрос;
	 
	 Запрос.Текст = "ВЫБРАТЬ
	 |	ПартииТоваровКомпанииОстатки.СкладКомпании,
	 |	ПартииТоваровКомпанииОстатки.Номенклатура,
	 |	ПартииТоваровКомпанииОстатки.ХарактеристикаНоменклатуры,
	 |	ПартииТоваровКомпанииОстатки.СтатусПартии,
	 |	ПартииТоваровКомпанииОстатки.Партия,
	 |	СУММА(ПартииТоваровКомпанииОстатки.КоличествоОстаток) КАК Количество,
	 |	СУММА(ПартииТоваровКомпанииОстатки.СуммаОстаток) КАК Себестоимость,
	 |	ПартииТоваровКомпанииОстатки.СкладКомпании.Подразделение.ДилерскийЦентр КАК ДилерскийЦентр
	 |ИЗ
	 |	РегистрНакопления.ПартииТоваровКомпании.Остатки(&ДатаКонца, ) КАК ПартииТоваровКомпанииОстатки
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ПартииТоваровКомпанииОстатки.Номенклатура,
	 |	ПартииТоваровКомпанииОстатки.СтатусПартии,
	 |	ПартииТоваровКомпанииОстатки.СкладКомпании,
	 |	ПартииТоваровКомпанииОстатки.ХарактеристикаНоменклатуры,
	 |	ПартииТоваровКомпанииОстатки.Партия";
 	 
	 ДатаОкончанияОтчета = КонецДня(ТекущаяДата());
	 Запрос.УстановитьПараметр ( "ДатаКонца", ДатаОкончанияОтчета );
	 
	 ТЗ = Запрос.Выполнить().Выгрузить();
	 
 	 ТЗ.Свернуть("ДилерскийЦентр","Количество,Себестоимость");
	 ТЗ.Сортировать("ДилерскийЦентр");
 	 //ТЗ.ВыбратьСтроку();
	 
 	 Макет = ПолучитьМакет("МакетПоДЦдляСебестоимости");
	 
	 ОбластьЗаголовок = Макет.ПолучитьОбласть("Заг");
	 ПериодСтрокой = Формат(ДатаОкончанияОтчета,"ДЛФ=D"); 
	 
	 ОбластьЗаголовок.Параметры.Загол = "Отчет по себестоимости на "+ПериодСтрокой;
 	 
	 ТабДок.Вывести(ОбластьЗаголовок);
	 
	 ОбластьШапки = Макет.ПолучитьОбласть("Шапка");
	 ТабДок.Вывести(ОбластьШапки);
	 
	 ОбластьСтр = Макет.ПолучитьОбласть("ОбластьСтрок");
	 
	 НПП = 0;
	 
	 Для Каждого стр из ТЗ Цикл
		 НПП = НПП + 1;
		 ОбластьСтр.Параметры.НПП            = НПП;	
		 ОбластьСтр.Параметры.ДилерскийЦентр = Стр.ДилерскийЦентр;	
		 ОбластьСтр.Параметры.Количество     = Формат(Стр.Количество,"ЧЦ=15; ЧДЦ=3");	
		 ОбластьСтр.Параметры.Себестоимость  = Формат(Стр.Себестоимость,"ЧЦ=15; ЧДЦ=2");	
 		 ТабДок.Вывести(ОбластьСтр);
	 КонецЦикла;
	 
	 ТЗ.Свернуть(,"Количество,Себестоимость");
	 
	 //ТЗ.ВыбратьСтроку();
	 
	 ОбластьИт = Макет.ПолучитьОбласть("ОбластьИт");
	 
	 Если ТЗ.Количество() > 0 Тогда
		 Для Каждого стр из ТЗ Цикл
			 ОбластьИт.Параметры.Количество     = Формат(Стр.Количество,"ЧЦ=15; ЧДЦ=3");	
			 ОбластьИт.Параметры.Себестоимость  = Формат(Стр.Себестоимость,"ЧЦ=15; ЧДЦ=2");	
 			 ТабДок.Вывести(ОбластьИт);
			 Прервать;
		 КонецЦикла;
	 КонецЕсли; 
 	 
	// 3 отчет - 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура КАК НоменклатураОстатков,
		|	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток,
		|	ОстаткиТоваровКомпанииОстатки.Номенклатура.Артикул,
		|	Продажи.Номенклатура КАК НоменклатураПродаж,
		|	Продажи.КоличествоОборот КАК КоличествоПродаж,
		|	ОстаткиТоваровКомпанииОстатки.СкладКомпании КАК СкладОстатков,
		|	Продажи.СкладКомпании КАК СкладПродаж,
		|	ОстаткиТоваровКомпанииОстатки.СкладКомпании.Подразделение.ДилерскийЦентр КАК ДилерскийЦентр,
		|	Продажи.ПодразделениеКомпании.ДилерскийЦентр
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(&ДатаКонца, ) КАК ОстаткиТоваровКомпанииОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ПродажиОбороты.ПодразделениеКомпании КАК ПодразделениеКомпании,
		|			ПродажиОбороты.Номенклатура КАК Номенклатура,
		|			ПродажиОбороты.Покупатель КАК Покупатель,
		|			ПродажиОбороты.СкладКомпании КАК СкладКомпании,
		|			СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоОборот
		|		ИЗ
		|			РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаКонца, , ) КАК ПродажиОбороты
		|		ГДЕ
		|			НЕ ПродажиОбороты.Покупатель В (&ГруппаНашиФирмы)
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ПродажиОбороты.ПодразделениеКомпании,
		|			ПродажиОбороты.Номенклатура,
		|			ПродажиОбороты.Покупатель,
		|			ПродажиОбороты.СкладКомпании) КАК Продажи
		|		ПО ОстаткиТоваровКомпанииОстатки.Номенклатура = Продажи.Номенклатура
		|			И ОстаткиТоваровКомпанииОстатки.СкладКомпании.Подразделение.ДилерскийЦентр = Продажи.ПодразделениеКомпании.ДилерскийЦентр";
		
	 ДатаНачалаОтчета    = НачалоДня(ДобавитьМесяц(ТекущаяДата(),-12));
	 ДатаОкончанияОтчета = КонецДня(ТекущаяДата());
	 
	 Запрос.УстановитьПараметр ( "ДатаНачала", ДатаНачалаОтчета );
	 Запрос.УстановитьПараметр ( "ДатаКонца", ДатаОкончанияОтчета );
  	 Запрос.УстановитьПараметр ("ГруппаНашиФирмы",Справочники.Контрагенты.НайтиПоНаименованию("Наши фирмы"));
	
  	ТЗ = Запрос.Выполнить().Выгрузить();
	
	//ТЗ.ВыбратьСтроку(ТЗ.Количество());
	
	ТЗ.Свернуть("ДилерскийЦентр","КоличествоПродаж,КоличествоОстаток");
	ТЗ.Колонки.Добавить("ОборотовЗаПериод");
	
	ТЗ.Сортировать("ДилерскийЦентр");
	
	//ТЗ.ВыбратьСтроку(ТЗ.Количество());
	
	Для каждого стр1 Из ТЗ Цикл
	    Если стр1.КоличествоОстаток > 0 Тогда
			стр1.ОборотовЗаПериод = Окр(100*стр1.КоличествоПродаж/стр1.КоличествоОстаток,2);
 		КонецЕсли; 
	КонецЦикла; 
	
	Макет = ПолучитьМакет("МакетОборачиваемость");
		
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заг");
	ПериодСтрокой = ПредставлениеПериода(ДатаНачалаОтчета, ДатаОкончанияОтчета, "ФП=истина"); 
	  
	ОбластьЗаголовок.Параметры.Загол = "Оборачиваемость склада за период "+ПериодСтрокой+" "+СокрЛП(СокрЛП(ДилерскийЦентр)+" "+СокрЛП(Подразделение));
	 	 
	ТабДок.Вывести(ОбластьЗаголовок);
	  
	ОбластьШапки = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(ОбластьШапки);
	
	НПП = 0;
 
 	ОбластьСтр = Макет.ПолучитьОбласть("ОбластьСтрок");
	
	Для Каждого стр из ТЗ Цикл
		НПП = НПП + 1; 
		ОбластьСтр.Параметры.НПП               = НПП;	
		ОбластьСтр.Параметры.ДилерскийЦентр    = Стр.ДилерскийЦентр;	
 		ОбластьСтр.Параметры.Продано           = Формат(Стр.КоличествоПродаж,"ЧЦ=15; ЧДЦ=3");
		ОбластьСтр.Параметры.Остаток           = Формат(Стр.КоличествоОстаток,"ЧЦ=15; ЧДЦ=3");
		ОбластьСтр.Параметры.Оборачиваемость   = Формат(Стр.ОборотовЗаПериод,"ЧДЦ=2");
		ТабДок.Вывести(ОбластьСтр);
	КонецЦикла;
 	
	ТЗ.Свернуть(,"КоличествоПродаж,КоличествоОстаток");
	ОбластьИт = Макет.ПолучитьОбласть("ОбластьИт");
	Для Каждого Стр из ТЗ Цикл
		ОбластьИт.Параметры.Продано = Стр.КоличествоПродаж;	
		ОбластьИт.Параметры.Остаток = Стр.КоличествоОстаток;	
		Если Стр.КоличествоОстаток > 0 Тогда
			ОбластьИт.Параметры.Оборачиваемость   = Формат(100*Стр.КоличествоПродаж/Стр.КоличествоОстаток,"ЧДЦ=2");
		Иначе			
			ОбластьИт.Параметры.Оборачиваемость   = "";
		КонецЕсли; 
 		ТабДок.Вывести(ОбластьИт);
		Прервать;
	КонецЦикла;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	//ОбластьПодвал.Параметры.СтрокаИтогов = "Отчет сформирован "+ТекущаяДата()+" пользователем "+ПараметрыСеанса.Пользователь;
	
	ТабДок.Вывести(ОбластьПодвал);
  	
	// - 4 отчет
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УценкаТоваров.Номенклатура,
	|	ПартииТоваровКомпанииОстатки.СкладКомпании,
	|	ПартииТоваровКомпанииОстатки.Номенклатура КАК НоменклатураПартии,
	|	ПартииТоваровКомпанииОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ПартииТоваровКомпанииОстатки.СуммаОстаток КАК СуммаОстаток,
	|	УценкаТоваров.Номенклатура.Артикул КАК НоменклатураАртикул,
	|	ПартииТоваровКомпанииОстатки.СкладКомпании.Подразделение.ДилерскийЦентр КАК ДилерскийЦентр
	|ИЗ
	|	РегистрСведений.УценкаТоваров КАК УценкаТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровКомпании.Остатки(&ДатаКонца, ) КАК ПартииТоваровКомпанииОстатки
	|		ПО УценкаТоваров.Номенклатура = ПартииТоваровКомпанииОстатки.Номенклатура";
		
		
	ДатаКонца = КонецДня(ТекущаяДата());	
	Запрос.Параметры.Вставить("ДатаКонца",ДатаКонца);	
  	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	//ТЗ.ВыбратьСтроку(ТЗ.Количество());
	
	ТЗ.Свернуть("ДилерскийЦентр","КоличествоОстаток,СуммаОстаток");
	ТЗ.Сортировать("ДилерскийЦентр");
	
 	//ТЗ.ВыбратьСтроку(ТЗ.Количество());
  	  
 	Макет = ПолучитьМакет("МакетНеликвид");
		
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заг");
	//ПериодСтрокой = ПредставлениеПериода(КонецДня(ПериодОтчета.ДатаОкончания), КонецДня(ПериодОтчета.ДатаОкончания),"ФП=истина"); 
	ПериодСтрокой =  Формат(ДатаКонца, "ДЛФ=DD");
	  
	ОбластьЗаголовок.Параметры.Загол = "Размер неликвидного складского запаса на "+ПериодСтрокой;
	 	 
	ТабДок.Вывести(ОбластьЗаголовок);
	  
	ОбластьШапки = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Вывести(ОбластьШапки);
	
	НПП = 0;
	
 	ОбластьСтр = Макет.ПолучитьОбласть("ОбластьСтрок");
	
	Для Каждого стр из ТЗ Цикл
		Если Число(Стр.СуммаОстаток) <= 0 Тогда
 			Продолжить;
 		КонецЕсли; 
		НПП = НПП + 1; 
		ОбластьСтр.Параметры.НПП                     = НПП;	
		ОбластьСтр.Параметры.ДилерскийЦентр          = Стр.ДилерскийЦентр;	
 		ОбластьСтр.Параметры.Количество              = Формат(Стр.КоличествоОстаток,"ЧДЦ=3");
		ОбластьСтр.Параметры.Сумма                   = Формат(Стр.СуммаОстаток,"ЧДЦ=2");
 		ТабДок.Вывести(ОбластьСтр);
	КонецЦикла;
		
 	ТЗ.Свернуть(,"КоличествоОстаток,СуммаОстаток");
	ОбластьИт = Макет.ПолучитьОбласть("ОбластьИт");
	Для Каждого Стр из ТЗ Цикл
		ОбластьИт.Параметры.Количество = Формат(Стр.КоличествоОстаток,"ЧДЦ=3");	
		ОбластьИт.Параметры.Сумма      = Формат(Стр.СуммаОстаток,"ЧДЦ=2");	
  	 	ТабДок.Вывести(ОбластьИт);
		Прервать;
	КонецЦикла;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	ОбластьПодвал.Параметры.СтрокаИтогов = "Отчет сформирован "+ТекущаяДата()+" пользователем "+ПараметрыСеанса.Пользователь;
	
	ТабДок.Вывести(ОбластьПодвал);
	
	//////////////////////////////////
	  
	 ТабДок.АвтоМасштаб=Истина;
	 ТабДок.ТолькоПросмотр=Истина;
	 ТабДок.ОтображатьСетку=Ложь;
	 ТабДок.ОтображатьГруппировки=Ложь;
	 //ТабДок.ФиксацияСверху=5;
	 
	 
	 WSS=Новый COMОбъект("WScript.Shell");
	 //Сообщить(WSS.SpecialFolders().Item("Desktop"));
	 ИмяКаталога=СокрЛП(WSS.SpecialFolders().Item("Desktop"));
	 
	 Сообщить("Имя каталога для файлов Excel "+ИмяКаталога);
	 
	 ИмяФайлаЭксель = СокрЛП(ТекущаяДата());
	 ИмяФайлаЭксель = СокрЛП(СтрЗаменить(ИмяФайлаЭксель,"/","_")); 
	 ИмяФайлаЭксель = СокрЛП(СтрЗаменить(ИмяФайлаЭксель,":","_")); 
	 ИмяФайлаЭксель = СокрЛП(СтрЗаменить(ИмяФайлаЭксель,".","_")); 
	 ИмяФайлаЭксель = СокрЛП(СтрЗаменить(ИмяФайлаЭксель," ","_")); 
	 ИмяФайлаЭксель = ИмяКаталога+"\"+ИмяФайлаЭксель;
	 ИмяФайлаЭксель = СокрЛП(ИмяФайлаЭксель)+".XLS";
	 
	 Попытка
		 ТабДок.Записать(ИмяФайлаЭксель,ТипФайлаТабличногоДокумента.XLS);
		 Сообщить("Записан файл "+ИмяФайлаЭксель);
	 Исключение
		 Сообщить("ОШИБКА! Не удалось записать файл "+ИмяФайлаЭксель);
	 КонецПопытки;	
	 
	 мКопии = Новый Массив;
	 //Набор = РегистрыСведений.ПолучателиСкладскихОтчетов.СоздатьНаборЗаписей();
	 //Набор.Прочитать();
	 
	 мТипыРассылок =  Новый Массив;
 	 мТипыРассылок.Добавить(Перечисления.ТипыРассылок.ПолучателиСкладскихОтчетов);
 	 ПодразделениеКомпании=ПараметрыСеанса.ПодразделениеКомпании.Родитель;
	 
	 Набор = г_Функции.ПолучитьПользователейДляРассылки(ПодразделениеКомпании,мТипыРассылок,Перечисления.ИсточникиРассылки.СкладскиеОтчеты);
	 
	 Если Набор.Количество() > 0 тогда
		 
		 Для каждого Стр Из Набор Цикл
			 Если обЗначениеНеЗаполнено(Стр) Тогда
				 Сообщить("ОШИБКА! Для сотрудника не найден адрес рабочей электронной почты.",СтатусСообщения.ОченьВажное);				
				 Продолжить;
			 КонецЕсли; 
			 мКому = Новый Массив;  
			 мКому.Добавить(Стр);
			 ДатаЗаказа = ТекущаяДата();
			 СсылкаДляПисьма = ИмяФайлаЭксель; 
			 Суть = "Основные показатели эффективности работы складов";
			 ТемаПисьма = ИмяФайлаЭксель; 
			 СоздатьИОтправитьЭлПисьмо(мКому,мКопии,ТемаПисьма,Суть,СсылкаДляПисьма,ИмяФайлаЭксель);
		 КонецЦикла;
		 
	 Иначе
		 
		 Сообщить("Не найдены получатели складских отчетов");
		 
	 КонецЕсли;	 	 
	 
	 ТабДок.Показать("Итоговая таблица");
 	 
 КонецПроцедуры
 
 Процедура СоздатьИОтправитьЭлПисьмо(мКому,МКопия, Тема, Тело,Основание,ИмяФайлаЭксель) Экспорт 
	 ЭлПисьмо = Документы.ЭлектронноеПисьмо.СоздатьДокумент();
	 ЭлПисьмо.ОтправительПредставление = "Альфа авто <1c@sokolmotors.ru>" ;
	 //Для Каждого стр из мКому цикл
	 //	ЭлПисьмо.ПолучателиПредставление =  ЭлПисьмо.ПолучателиПредставление +?( ЭлПисьмо.ПолучателиПредставление="",стр,";"+стр); 
	 //КонецЦикла;  
	 //Для Каждого стр из МКопия цикл
	 //	ЭлПисьмо.КопииПредставление =  ЭлПисьмо.КопииПредставление +?( ЭлПисьмо.КопииПредставление="",стр,";"+стр); 
	 //КонецЦикла;
	 Для Каждого стр из мКому цикл
		 СтрокаПолуатели = ЭлПисьмо.Получатели.Добавить();
		 СтрокаПолуатели.АдресЭлектроннойПочты=стр;
		 СтрокаПолуатели.Представление=стр;
		 СтрокаПолуатели.КодГруппыАдреса             =Перечисления.КодГруппыАдресаЭлектронногоПисьма.Кому ;
		 ЭлПисьмо.ПолучателиПредставление =  ЭлПисьмо.ПолучателиПредставление +?( ЭлПисьмо.ПолучателиПредставление="",стр,";"+стр); 
	 КонецЦикла;
	 ЭлПисьмо.Тема = Тема;
	 ЭлПисьмо.ТекстПисьма= Тело;
	 ЭлПисьмо.ДокументОснование = Основание;
	 ЭлПисьмо.УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.Альфа;
	 ЭлПисьмо.ГруппаПисем = Справочники.ГруппыПисемЭлектроннойПочты.НайтиПоНаименованию("Исходящие");
	 ЭлПисьмо.Важность = Перечисления.Важность.Высокая;
	 //ЭлПисьмо.ДатаОтправления =ТекущаяДата();
	 ЭлПисьмо.Дата = ТекущаяДата()  ;
	 ЭлПисьмо.ХозОперация = Справочники.ХозОперации.ЭлектронноеПисьмо;
	 ЭлПисьмо.УчетнаяЗапись = Справочники.УчетныеЗаписиЭлектроннойПочты.Альфа;	
	 ЭлПисьмо.Организация =   ПараметрыСеанса.Пользователь.Организация;
	 ЭлПисьмо.ПодразделениеКомпании = ПараметрыСеанса.Пользователь.Подразделение;
	 ЭлПисьмо.Автор   = ПараметрыСеанса.Пользователь;
	 ЭлПисьмо.ФорматТекста = Перечисления.ФорматТекста.ПростойТекст; 
	 
	 ЭлПисьмо.ЕстьВложения=Истина;
	 
	 МассивВложений = Новый Массив;
	 МассивВложений.Добавить(ИмяФайлаЭксель);
	 
	 ДобавитьВложенияВПисьмо(ЭлПисьмо.ПрикрепленныеФайлы, МассивВложений);
	 
	 
	 ЭлПисьмо.Записать();
	 СтруктураРежимовОбмена = Новый Структура("Получить, Отправить", Ложь, Истина);
	 СоединениеСПочтовымСервером = эпПодключитьсяКПочтовомуСерверу(ЭлПисьмо.УчетнаяЗапись, СтруктураРежимовОбмена);
	 Если СоединениеСПочтовымСервером <> Неопределено Тогда
		 Если эпОтправитьПисьмо(ЭлПисьмо.ЭтотОбъект, СоединениеСПочтовымСервером) Тогда
			 эпОтключитьсяОтПочтовогоСервера(СоединениеСПочтовымСервером);
			 //Закрыть();
		 Иначе
			 эпОтключитьсяОтПочтовогоСервера(СоединениеСПочтовымСервером);
		 КонецЕсли;	
	 КонецЕсли;
	 
 КонецПроцедуры	
 
 Процедура ДобавитьВложенияВПисьмо(ПрикрепленныеФайлы, МассивВложений)
	 
	 Для Каждого ПолученноеИмяФайла Из МассивВложений Цикл
		 
		 ИмяФайла = ПолученноеИмяФайла;
		 
		 Файл = Новый Файл(ИмяФайла);
		 
		 Пока Найти(ИмяФайла,"\")>0 Цикл
			 ИмяФайла = Прав(ИмяФайла,СтрДлина(ИмяФайла) - Найти(ИмяФайла,"\"));
		 КонецЦикла;	
		 
		 //Если Файл.Размер() > 26214400 Тогда
		 //	
		 //	Ответ = Вопрос("Размер добавляемого файла """ + ИмяФайла + """
		 //	|больше 25 Mb. Добавить ?", РежимДиалогаВопрос.ДаНетОтмена,,КодВозвратаДиалога.Нет,"Внимание!");
		 //	Если Ответ = КодВозвратаДиалога.Нет Тогда
		 //		Продолжить;
		 //	ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
		 //		Возврат;
		 //	КонецЕсли; 
		 //КонецЕсли;
		 
		 НоваяСтрока = ПрикрепленныеФайлы.Добавить();
		 НоваяСтрока.Имя = ОбрезатьИмяФайла(ИмяФайла, 100, Истина);
		 
		 //#Если Клиент Тогда 
		 Состояние("Добавляется файл: " + НоваяСтрока.Имя);
		 //#КонецЕсли
		 ДвоичныйФайл = Новый ДвоичныеДанные(Файл.ПолноеИмя);
		 НоваяСтрока.Файл = ПолучитьХранилищеЗначений(ДвоичныйФайл);
		 //НоваяСтрока.Файл = Новый ХранилищеЗначения(Новый ДвоичныеДанные(Файл.ПолноеИмя), Новый СжатиеДанных());
		 НоваяСтрока.Размер = Файл.Размер();
		 
		 //Попытка
		 //	УдалитьФайлы(ПолученноеИмяФайла);
		 //Исключение
		 //	Сообщить("Не удалось удалить файл: " +	ПолученноеИмяФайла);
		 //КонецПопытки
		 
	 КонецЦикла;
	 
 КонецПроцедуры // ДобавитьВложенияВПисьмо()
 
 // Функция корректно обрезает имя файла если оно  больше 100 символов, 
 // чтобы осталось расширение. (рфОбрезатьИмяФайла("ОченьДлинноеИмяФайла.txt",20) -> ОченьДлинноеИмяФ.txt)
 //
 // Параметры
 //  ИмяФайла 		   – Строка, содержащая имя файла, неважно с именем каталога или без.
 //  КоличествоСимволов – Число, кол-во символов, до которого необходимо урезать имя файла.
 //  ВыводитьСообщение  – Булево, признак необходимости вывести сообщение что имя файла обрезано.
 //
 // Возвращаемое значение:
 //  Строка   – обрезанное имя файла.
 //
 Функция ОбрезатьИмяФайла(Знач ИмяФайла, КоличествоСимволов, ВыводитьСообщение=Ложь) Экспорт
	 
	 Если СтрДлина(ИмяФайла) > КоличествоСимволов Тогда
		 Если ВыводитьСообщение Тогда
			 Сообщить("Имя файла """+ИмяФайла+""" обрезано, так как его длина больше "+КоличествоСимволов+" символов", СтатусСообщения.Информация);
		 КонецЕсли; 
		 РасширениеФайла = рфПолучитьРасширениеФайла(ИмяФайла);
		 СамоИмяФайла = Лев(ИмяФайла, СтрДлина(ИмяФайла)-СтрДлина(РасширениеФайла)-1);
		 СамоИмяФайла = Лев(СамоИмяФайла, КоличествоСимволов-СтрДлина(РасширениеФайла)-1);
		 ИмяФайла = СамоИмяФайла + "." + РасширениеФайла;
	 КонецЕсли;
	 
	 Возврат ИмяФайла;
	 
 КонецФункции // ОбрезатьИмяФайла()
 
 Функция ПолучитьХранилищеЗначений(Файл)
	 
	 Возврат Новый ХранилищеЗначения(Файл, Новый СжатиеДанных());
	 
 КонецФункции
 
 // Получить остатки номенклатуры
 // Номенклатура - СправочникСсылка на номенклатуру
 // ХарактеристикаНоменклатуры - СправочникСсылка на ХарактеристикаНоменклатуры
 // Возвращаемое значение Число - остаток номенклатуры
 Функция ПолучитьОстаткиНоменклатурыНаСкладах(Номенклатура,ДатаЗаказа) Экспорт
	 
	 ДатаОстатков = ДатаЗаказа;
	 
	 ОстатокНоменклатуры=0;
	 
	 Запрос = Новый Запрос;
	 
	 Запрос.Текст = "ВЫБРАТЬ
	 |	ОстаткиТоваровКомпанииОстатки.СкладКомпании КАК СкладКомпании,
	 |	ОстаткиТоваровКомпанииОстатки.КоличествоОстаток КАК Остаток
	 |ИЗ
	 |	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(&ДатаОстатков, Номенклатура = &Номенклатура) КАК ОстаткиТоваровКомпанииОстатки
	 |";
	 
	 Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	 Запрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);
	 
	 ВыборкаОстатковНоменклатурыНаСкладах=Запрос.Выполнить().Выбрать();
	 
	 Пока ВыборкаОстатковНоменклатурыНаСкладах.Следующий() Цикл
		 ОстатокНоменклатуры=ОстатокНоменклатуры + ВыборкаОстатковНоменклатурыНаСкладах.Остаток;
	 КонецЦикла; 
	 
	 Возврат ОстатокНоменклатуры;
	 
 КонецФункции
